export class Expertise {
    expertiseid: string
    expertiseName: string
}

export class Science {
    สาขาวิชาเคมี = "สาขาวิชาเคมี"
    สาขาวิชาชีววิทยา = "สาขาวิชาชีววิทยา"
    สาธารณสุขชุมชน = "สาธารณสุขชุมชน"
    สาขาวิชาคณิตศาสตร์ = "สาขาวิชาคณิตศาสตร์"
    สาขาวิชาสถิติประยุกต์ = "สาขาวิชาสถิติประยุกต์"
    วิทยาศาสตร์สิ่งแวดล้อม = "วิทยาศาสตร์สิ่งแวดล้อม"
    สาขาวิชาสาธารณสุขชุมชน = "สาขาวิชาสาธารณสุขชุมชน"
    สาขาวิชาวิทยาศาสตร์สิ่งทอ = "สาขาวิชาวิทยาศาสตร์สิ่งทอ"
    สาขาวิชาวิทยาศาสตร์การกีฬา = "สาขาวิชาวิทยาศาสตร์การกีฬา"
    สาขาวิชาวิทยาการคอมพิวเตอร์ = "สาขาวิชาวิทยาการคอมพิวเตอร์"
    สาขาวิชาเทคโนโลยีสารสนเทศ = "สาขาวิชาเทคโนโลยีสารสนเทศ"
    สาขาวิชาวิทยาศาสตร์การอาหาร = "สาขาวิชาวิทยาศาสตร์การอาหาร"
    สาขาวิชาวิทยาศาสตร์สิ่งแวดล้อม = "สาขาวิชาวิทยาศาสตร์สิ่งแวดล้อม"
    สาขาวิชาภูมิศาสตร์และภูมิสารสนเทศ = "สาขาวิชาภูมิศาสตร์และภูมิสารสนเทศ"
}

export class Education {
    สาขาวิชาฟิสิกส์ = "สาขาวิชาฟิสิกส์"
    สาขาวิชานาฏศิลป์ = "สาขาวิชานาฏศิลป์"
    สาขาวิชาพลศึกษา = "สาขาวิชาพลศึกษา"
    สาขาวิชาภาษาไทย = "สาขาวิชาภาษาไทย"
    สาขาวิชาศิลปศึกษา = "สาขาวิชาศิลปศึกษา"
    สาขาวิชาดนตรีศึกษา = "สาขาวิชาดนตรีศึกษา"
    สาขาวิชาสังคมศึกษา = "สาขาวิชาสังคมศึกษา"
    สาขาวิชาคณิตศาสตร์ = "สาขาวิชาคณิตศาสตร์"
    สาขาวิชาภาษาอังกฤษ = "สาขาวิชาภาษาอังกฤษ"
    สาขาวิชาการศึกษาปฐมวัย = "สาขาวิชาการศึกษาปฐมวัย"
    สาขาวิชาวิทยาศาสตร์ทั่วไป = "สาขาวิชาวิทยาศาสตร์ทั่วไป"
    สาขาวิชาเทคโนโลยีและนวัตกรรมการศึกษา = "สาขาวิชาเทคโนโลยีและนวัตกรรมการศึกษา"
    สาขาวิชาเทคโนโลยีและคอมพิวเตอร์เพื่อการศึกษา = "สาขาวิชาเทคโนโลยีและคอมพิวเตอร์เพื่อการศึกษา"
}


export class IndustrialTechnology {
    สาขาวิชาออกแบบผลิตภัณฑ์ = "สาขาวิชาออกแบบผลิตภัณฑ์"
    สาขาวิชาเทคโนโลยีวิศวกรรมโยธา = "สาขาวิชาเทคโนโลยีวิศวกรรมโยธา"
    สาขาวิชาเทคโนโลยีสถาปัตยกรรม = "สาขาวิชาเทคโนโลยีสถาปัตยกรรม"
    สาขาวิชาเทคโนโลยีวิศวกรรมไฟฟ้า = "สาขาวิชาเทคโนโลยีวิศวกรรมไฟฟ้า"
    สาขาวิชาวิศวกรรมการจัดการอุตสาหกรรม = "สาขาวิชาวิศวกรรมการจัดการอุตสาหกรรม"
    สาขาวิชาเทคโนโลยีวิศวกรรมอิเล็กทรอนิกส์ = "สาขาวิชาเทคโนโลยีวิศวกรรมอิเล็กทรอนิกส์"
    สาขาวิชาเทคโนโลยีเซรามิกส์และการออกแบบ = "สาขาวิชาเทคโนโลยีเซรามิกส์และการออกแบบ"
}

export class AgriculturalTechnology {
    สาขาวิชาประมง = "สาขาวิชาประมง"
    สาขาวิชาสัตวศาสตร์ = "สาขาวิชาสัตวศาสตร์"
    สาขาวิชาเกษตรศาสตร์ = "สาขาวิชาเกษตรศาสตร์"
}

export class HumanitiesandSocialSciences {
    สาขาวิชาดนตรี = "สาขาวิชาดนตรี"
    สาขาวิชานิติศาสตร์ = "สาขาวิชานิติศาสตร์"
    สาขาวิชาภาษาไทย = "สาขาวิชาภาษาไทย"
    สาขาวิชาศิลปะดิจิทัล = "สาขาวิชาศิลปะดิจิทัล"
    สาขาวิชาภาษาอังกฤษ = "สาขาวิชาภาษาอังกฤษ"
    สาขาวิชาการพัฒนาสังคม = "สาขาวิชาการพัฒนาสังคม"
    สาขาวิชาภาษาอังกฤษธุรกิจ = "สาขาวิชาภาษาอังกฤษธุรกิจ"
    สาขาวิชารัฐประศาสนศาสตร์ = "สาขาวิชารัฐประศาสนศาสตร์"
    สาขาวิชาบรรณารักษ์ศาสตร์และสารสนเทศศาสตร์ = "สาขาวิชาบรรณารักษ์ศาสตร์และสารสนเทศศาสตร์"
}

export class ManagementScience {
    สาขาวิชาบัญชี = "สาขาวิชาบัญชี"
    สาขาวิชาการตลาด = "สาขาวิชาการตลาด"
    สาขาวิชาการจัดการ = "สาขาวิชาการจัดการ"
    สาขาวิชาเศรษฐศาสตร์ = "สาขาวิชาเศรษฐศาสตร์"
    สาขาวิชาคอมพิวเตอร์ธุรกิจ = "สาขาวิชาคอมพิวเตอร์ธุรกิจ"
    สาขาวิชาการสื่อสารมวลชน = "สาขาวิชาการสื่อสารมวลชน"
    สาขาวิชาการเงินและการธนาคาร = "สาขาวิชาการเงินและการธนาคาร"
    สาขาวิชาการบริหารทรัพยากรมนุษย์ = "สาขาวิชาการบริหารทรัพยากรมนุษย์"
    สาขาวิชาการท่องเที่ยวและการโรงแรม = "สาขาวิชาการท่องเที่ยวและการโรงแรม"
}

export enum ExpertiseTh {

    // คณะวิทยาศาสตร์
    สาขาวิชาเคมี = "สาขาวิชาเคมี",
    วิทยาศาสตร์สิ่งแวดล้อม = "วิทยาศาสตร์สิ่งแวดล้อม",
    สาขาวิชาเทคโนโลยีสารสนเทศ = "สาขาวิชาเทคโนโลยีสารสนเทศ",
    สาขาวิชาชีววิทยา = "สาขาวิชาชีววิทยา",
    สาขาวิชาวิทยาการคอมพิวเตอร์ = "สาขาวิชาวิทยาการคอมพิวเตอร์",
    สาขาวิชาวิทยาศาสตร์การกีฬา = "สาขาวิชาวิทยาศาสตร์การกีฬา",
    สาขาวิชาวิทยาศาสตร์การอาหาร = "สาขาวิชาวิทยาศาสตร์การอาหาร",
    สาขาวิชาวิทยาศาสตร์สิ่งทอ = "สาขาวิชาวิทยาศาสตร์สิ่งทอ",
    สาขาวิชาวิทยาศาสตร์สิ่งแวดล้อม = "สาขาวิชาวิทยาศาสตร์สิ่งแวดล้อม",
    สาขาวิชาสถิติประยุกต์ = "สาขาวิชาสถิติประยุกต์",
    สาธารณสุขชุมชน = "สาธารณสุขชุมชน",
    สาขาวิชาสาธารณสุขชุมชน = "สาขาวิชาสาธารณสุขชุมชน",
    สาขาวิชาภูมิศาสตร์และภูมิสารสนเทศ = "สาขาวิชาภูมิศาสตร์และภูมิสารสนเทศ",
    //คณะครุศาสตร์
    สาขาวิชาเทคโนโลยีและนวัตกรรมการศึกษา = "สาขาวิชาเทคโนโลยีและนวัตกรรมการศึกษา",
    สาขาวิชาเทคโนโลยีและคอมพิวเตอร์เพื่อการศึกษา = "สาขาวิชาเทคโนโลยีและคอมพิวเตอร์เพื่อการศึกษา",
    สาขาวิชาการศึกษาปฐมวัย = "สาขาวิชาการศึกษาปฐมวัย",
    สาขาวิชาสังคมศึกษา = "สาขาวิชาสังคมศึกษา",
    สาขาวิชาคณิตศาสตร์ = "สาขาวิชาคณิตศาสตร์",
    สาขาวิชาฟิสิกส์ = "สาขาวิชาฟิสิกส์",
    สาขาวิชาวิทยาศาสตร์ทั่วไป = "สาขาวิชาวิทยาศาสตร์ทั่วไป",
    สาขาวิชาพลศึกษา = "สาขาวิชาพลศึกษา",
    สาขาวิชาดนตรีศึกษา = "สาขาวิชาดนตรีศึกษา",
    สาขาวิชาศิลปศึกษา = "สาขาวิชาศิลปศึกษา",
    สาขาวิชานาฏศิลป์ = "สาขาวิชานาฏศิลป์",
    //คณะเทคโนโลยีอุตสาหกรรม
    สาขาวิชาออกแบบผลิตภัณฑ์ = "สาขาวิชาออกแบบผลิตภัณฑ์",
    สาขาวิชาเทคโนโลยีวิศวกรรมโยธา = "สาขาวิชาเทคโนโลยีวิศวกรรมโยธา",
    สาขาวิชาเทคโนโลยีสถาปัตยกรรม = "สาขาวิชาเทคโนโลยีสถาปัตยกรรม",
    สาขาวิชาเทคโนโลยีวิศวกรรมไฟฟ้า = "สาขาวิชาเทคโนโลยีวิศวกรรมไฟฟ้า",
    สาขาวิชาวิศวกรรมการจัดการอุตสาหกรรม = "สาขาวิชาวิศวกรรมการจัดการอุตสาหกรรม",
    สาขาวิชาเทคโนโลยีวิศวกรรมอิเล็กทรอนิกส์ = "สาขาวิชาเทคโนโลยีวิศวกรรมอิเล็กทรอนิกส์",
    สาขาวิชาเทคโนโลยีเซรามิกส์และการออกแบบ = "สาขาวิชาเทคโนโลยีเซรามิกส์และการออกแบบ",
    //คณะเทคโนโลยีการเกษตร
    สาขาวิชาเกษตรศาสตร์ = "สาขาวิชาเกษตรศาสตร์",
    สาขาวิชาประมง = "สาขาวิชาประมง",
    สาขาวิชาสัตวศาสตร์ = "สาขาวิชาสัตวศาสตร์",
    //คณะมนุษยศาสตร์และสังคมศาสตร์
    สาขาวิชาภาษาไทย = "สาขาวิชาภาษาไทย",
    สาขาวิชาภาษาอังกฤษ = "สาขาวิชาภาษาอังกฤษ",
    สาขาวิชาภาษาอังกฤษธุรกิจ = "สาขาวิชาภาษาอังกฤษธุรกิจ",
    สาขาวิชารัฐประศาสนศาสตร์ = "สาขาวิชารัฐประศาสนศาสตร์",
    สาขาวิชาศิลปะดิจิทัล = "สาขาวิชาศิลปะดิจิทัล",
    สาขาวิชาการพัฒนาสังคม = "สาขาวิชาการพัฒนาสังคม",
    สาขาวิชาบรรณารักษ์ศาสตร์และสารสนเทศศาสตร์ = "สาขาวิชาบรรณารักษ์ศาสตร์และสารสนเทศศาสตร์",
    สาขาวิชานิติศาสตร์ = "สาขาวิชานิติศาสตร์",
    สาขาวิชาดนตรี = "สาขาวิชาดนตรี",
    //คณะวิทยาการจัดการ
    สาขาวิชาบัญชี = "สาขาวิชาบัญชี",
    สาขาวิชาการตลาด = "    สาขาวิชาการตลาด",
    สาขาวิชาการจัดการ = "    สาขาวิชาการจัดการ",
    สาขาวิชาเศรษฐศาสตร์ = "    สาขาวิชาเศรษฐศาสตร์",
    สาขาวิชาคอมพิวเตอร์ธุรกิจ = "    สาขาวิชาคอมพิวเตอร์ธุรกิจ",
    สาขาวิชาการสื่อสารมวลชน = "    สาขาวิชาการสื่อสารมวลชน",
    สาขาวิชาการเงินและการธนาคาร = "    สาขาวิชาการเงินและการธนาคาร",
    สาขาวิชาการบริหารทรัพยากรมนุษย์ = "    สาขาวิชาการบริหารทรัพยากรมนุษย์",
    สาขาวิชาการท่องเที่ยวและการโรงแรม = "    สาขาวิชาการท่องเที่ยวและการโรงแรม",
    // คณะพยายาลศาสตร์

}

export namespace Expertise {
    export function values() { return Object.keys(Expertise).filter((type) => isNaN(<any>type) && type !== 'values'); } //&& type !== 'values'
}

export namespace ExpertiseTh {
    export function values() { return Object.keys(ExpertiseTh).filter((type) => isNaN(<any>type) && type !== 'values'); } //&& type !== 'values'
}